; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_95)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 obj6 - truck
	obj7 obj8 obj11 obj13 obj16 - package
	obj9 obj10 obj12 - location
	obj14 obj15 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj3)
	(at obj7 obj0)
	(at obj8 obj0)
	(at obj11 obj3)
	(at obj13 obj0)
	(at obj14 obj3)
	(at obj15 obj3)
	(at obj16 obj3)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj9 obj1)
	(in-city obj10 obj4)
	(in-city obj12 obj4)
)

(:goal (and
	(at obj7 obj12)
	(at obj8 obj10)
	(at obj11 obj9)
	(at obj13 obj10)
	(at obj16 obj9)
))
)

; plan
1. (drive obj2 obj0 obj9)
   deleted: (at obj2 obj0)
   added: (at obj2 obj9)
   goals met: 0 of 5
2. (drive obj5 obj3 obj10)
   deleted: (at obj5 obj3)
   added: (at obj5 obj10)
   goals met: 0 of 5
3. (drive obj6 obj3 obj10)
   deleted: (at obj6 obj3)
   added: (at obj6 obj10)
   goals met: 0 of 5
4. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 5
5. (drive obj5 obj10 obj3)
   deleted: (at obj5 obj10)
   added: (at obj5 obj3)
   goals met: 0 of 5
6. (drive obj6 obj10 obj3)
   deleted: (at obj6 obj10)
   added: (at obj6 obj3)
   goals met: 0 of 5
7. (load obj14 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj14)
   goals met: 0 of 5
8. (load obj14 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj14)
   goals met: 0 of 5
9. (load obj14 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj14)
   goals met: 0 of 5
10. (load obj15 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj15)
   goals met: 0 of 5
11. (load obj15 obj16 obj3)
   deleted: (at obj16 obj3)
   added: (in obj16 obj15)
   goals met: 0 of 5
12. (fly obj14 obj0 obj3)
   deleted: (at obj14 obj0)
   added: (at obj14 obj3)
   goals met: 0 of 5
13. (fly obj15 obj3 obj0)
   deleted: (at obj15 obj3)
   added: (at obj15 obj0)
   goals met: 0 of 5
14. (drive obj2 obj9 obj0)
   deleted: (at obj2 obj9)
   added: (at obj2 obj0)
   goals met: 0 of 5
15. (unload obj14 obj13 obj3)
   deleted: (in obj13 obj14)
   added: (at obj13 obj3)
   goals met: 0 of 5
16. (unload obj14 obj7 obj3)
   deleted: (in obj7 obj14)
   added: (at obj7 obj3)
   goals met: 0 of 5
17. (unload obj14 obj8 obj3)
   deleted: (in obj8 obj14)
   added: (at obj8 obj3)
   goals met: 0 of 5
18. (unload obj15 obj11 obj0)
   deleted: (in obj11 obj15)
   added: (at obj11 obj0)
   goals met: 0 of 5
19. (unload obj15 obj16 obj0)
   deleted: (in obj16 obj15)
   added: (at obj16 obj0)
   goals met: 0 of 5
20. (fly obj15 obj0 obj3)
   deleted: (at obj15 obj0)
   added: (at obj15 obj3)
   goals met: 0 of 5
21. (load obj2 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj2)
   goals met: 0 of 5
22. (load obj2 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj2)
   goals met: 0 of 5
23. (load obj5 obj7 obj3)
   deleted: (at obj7 obj3)
   added: (in obj7 obj5)
   goals met: 0 of 5
24. (load obj6 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj6)
   goals met: 0 of 5
25. (load obj6 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj6)
   goals met: 0 of 5
26. (drive obj2 obj0 obj9)
   deleted: (at obj2 obj0)
   added: (at obj2 obj9)
   goals met: 0 of 5
27. (drive obj5 obj3 obj12)
   deleted: (at obj5 obj3)
   added: (at obj5 obj12)
   goals met: 0 of 5
28. (drive obj6 obj3 obj10)
   deleted: (at obj6 obj3)
   added: (at obj6 obj10)
   goals met: 0 of 5
29. (fly obj15 obj3 obj0)
   deleted: (at obj15 obj3)
   added: (at obj15 obj0)
   goals met: 0 of 5
30. (unload obj2 obj11 obj9)
   deleted: (in obj11 obj2)
   added: (at obj11 obj9)
   goals met: 1 of 5
31. (unload obj2 obj16 obj9)
   deleted: (in obj16 obj2)
   added: (at obj16 obj9)
   goals met: 2 of 5
32. (unload obj5 obj7 obj12)
   deleted: (in obj7 obj5)
   added: (at obj7 obj12)
   goals met: 3 of 5
33. (unload obj6 obj13 obj10)
   deleted: (in obj13 obj6)
   added: (at obj13 obj10)
   goals met: 4 of 5
34. (unload obj6 obj8 obj10)
   deleted: (in obj8 obj6)
   added: (at obj8 obj10)
   goals met: 5 of 5
